In [1]:
import pandas as pd

In [13]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
se=pd.Series([4,8,15,23,42])

In [14]:
se

0     4
1     8
2    15
3    23
4    42
dtype: int64

In [ ]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.

In [17]:
data=[1,2,3,4,5,6,7,8,9,10]
seri=pd.Series(data)
print(seri)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
# Q3. Create a Pandas DataFrame that contains the following data:

In [18]:
Dframe={
'name': ['Alice', 'Bob', 'claire'],
    'Age': [25,30,27],
    'Gender': ['Female', 'Male', 'Female']
}

In [19]:
df1=pd.DataFrame(Dframe)

In [20]:
df1

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  claire   27  Female

In [23]:
"""
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans: DataFrames are multi-dimensional table, having data store in row and columns is dataframe.
     
     Basically, in series data store in one dimensional form like array, but in dataframe data store
     in row and column like two- dimensional form (table).

Example of series.
"""
d1=['abishek', 'subasj', 'rishav']
s1=pd.Series(d1)
print(s1)

0    abishek
1     subasj
2     rishav
dtype: object

In [26]:
#example of data drame;
d={
    'name': ['abishek', 'subash', 'rishav'],
    'age':[11,22,32]
}
df2=pd.DataFrame(d)
print(df2)

      name  age
0  abishek   11
1   subash   22
2   rishav   32

In [ ]:
"""
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans: 
1. describe() : shows statistical thing in data like count, mean, sd.
2. to_csv(): save the csv in our local device.
3. drop():  : To delete row which we want.
4. set_index(): set the  dataframe index from column name
"""

In [30]:
df2.set_index('name')

         age
name
abishek   11
subash    22
rishav    32

In [31]:
df2.drop(0)

     name  age
1  subash   22
2  rishav   32

In [32]:
df2.describe()

             age
count   3.000000
mean   21.666667
std    10.503968
min    11.000000
25%    16.500000
50%    22.000000
75%    27.000000
max    32.000000

In [ ]:
"""
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans: DataFrame is mutable provide grate flexibility to work with.

In [34]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.
sts=['abishek','navin','shambu']
subj=['math', 'science','English']
mark=[12,34,56]
Dframe=pd.Series(['sts','subj','mark'])
print(Dframe)

0     sts
1    subj
2    mark
dtype: object